UKS/src/Documents/КомандировочноеУдостоверение/КомандировочноеУдостоверение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомандировочноеУдостоверение</name>
  <registerRecords>InformationRegister.РегистрКомандировочных</registerRecords>
  <attributes>
    <name>КудаКомандировать</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКомандировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКомандировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦельКомандировки</name>
    <type>
      <types>CatalogRef.ЦелиКомандировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдалЗадание</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоСлужебнойКомандировки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПоКомандировке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппаРаботников</name>
    <attributes>
      <name>ФИОполное</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/InformationRegisters/РегистрКомандировочных/РегистрКомандировочных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрКомандировочных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦельКомандировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>819</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестоКомандировки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КудаКомандировать</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Documents/КомандировочноеУдостоверение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.РегистрКомандировочных.Записывать = Истина;
	Движение = Движения.РегистрКомандировочных.Добавить();
	Движение.Период = Дата;
	Движение.НомерПриказа = НомерПриказа;
	Движение.ДатаПриказа = ДатаПриказа;
	Движение.ЦельКомандировки = ЦельКомандировки;
	Движение.КудаКомандировать = КудаКомандировать;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерПриказа = "";
	ДатаПриказа = Дата(1,1,1,0,0,0);
КонецПроцедуры
